##
## gridにおさめられた文字を出力するサンプルスクリプト
##

grid = [['.', '.', '.', '.', '.', '.'],
        ['.', 'O', 'O', '.', '.', '.'],
        ['O', 'O', 'O', 'O', '.', '.'],
        ['O', 'O', 'O', 'O', 'O', '.'],
        ['.', 'O', 'O', 'O', 'O', 'O'],
        ['O', 'O', 'O', 'O', 'O', '.'],
        ['O', 'O', 'O', 'O', '.', '.'],
        ['.', 'O', 'O', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.']]

tate = len(grid)    ## 行数
yoko = len(grid[0]) ## 列数
i = 0   ## 行カウンタ
j = 0   ## 列カウンタ

while i < tate :

    ## 最初～最後から2番めまで出力
    if j < (yoko - 1) :
        print(grid[i][j], end='')  ## 「end=''」をつけると改行せずに出力
        j = j + 1

    ## 最後を出力し、行カウンタを追加し(改行)、列カウンタを一文字目に戻す
    elif j == (yoko - 1) :
        print(grid[i][j])
        j = 0
        i = i + 1
